package Task_11;

import java.io.FileNotFoundException;
import java.io.FileReader;
import java.io.FileWriter;
import java.io.IOException;
import java.util.Scanner;

/*
Игра (4%)
Время: 1 сек.
Память: 16 Мб
Сложность: 4%

В свободное время одноклассники Вася и Петя любят играть в различные логические игры: морской бой, крестики-нолики,
шахматы, шашки и многое другое. Ребята уже испробовали и поиграли во всевозможные классические игры подобного рода,
включая компьютерные. Однажды им захотелось сыграть во что-нибудь новое, но ничего подходящего найти не удалось. Тогда
Петя придумал следующую игру «Угадайка»: Играют двое участников. Первый загадывает любое трехзначное число, такое что
первая и последняя цифры отличаются друг от друга более чем на единицу. Далее загадавший число игрок переворачивает
загаданное число, меняя первую и последнюю цифры местами, таким образом получая еще одно число. Затем из максимального
из полученных двух чисел вычитается минимальное. Задача второго игрока – угадать по первой цифре полученного в результате
вычитания числа само это число. Например, если Вася загадал число 487, то перестановкой первой и последней цифры он получит
число 784. После чего ему придется вычесть из 784 число 487, в результате чего получится число 297, которое и должен
отгадать Петя по указанной первой цифре «2», взятой из этого числа. Петя успевает лучше Васи по математике, поэтому
практически всегда выигрывает в играх такого типа. Но в данном случае Петя схитрил и специально придумал такую игру, в
которой он не проиграет Васе в любом случае. Дело в том, что придуманная Петей игра имеет выигрышную стратегию, которая
заключается в следующем: искомое число всегда является трехзначным и вторая его цифра всегда равна девяти, а для
получения значения последней достаточно отнять от девяти первую, т.е. в рассмотренном выше случае последняя цифра равна
9-2=7. Помогите Пете еще упростить процесс отгадывания числа по заданной его первой цифре, написав соответствующую
программу.

Формат ввода
В единственной строке входного файла input.txt задана единственная цифра К, соответствующая первой цифре полученного
Васей в результате вычитания наименьшего загаданного Васей значения из наибольшего.

Формат вывода
В выходной файл output.txt нужно вывести значение полученной Васей разности.

Пример 1
Ввод	Вывод
5   	594
2	    297
 */
public class Game {
    public static void main(String[] args) {
        int a, c;
        int b = 9;
        String result;

        try (FileReader reader = new FileReader("task-11-input.txt")) {
            Scanner scanner = new Scanner(reader);
            a = scanner.nextInt();
        } catch (FileNotFoundException e) {
            throw new RuntimeException(e);
        } catch (IOException e) {
            throw new RuntimeException(e);
        }

        c = b - a;
        result = String.valueOf(a) + String.valueOf(b) + String.valueOf(c);

        try (FileWriter writer = new FileWriter("task-11-output.txt")){
            writer.write(result);
        } catch (IOException e) {
            throw new RuntimeException(e);
        }
    }
}
